Autodesk.Revit.DB.DeleteElements.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates an instance of the DeleteElements resolution.
document:
The document which owns the element to delete.
id:
The id of the element that will be deleted when this resolution is chosen.
Returns:
The instance of the DeletedElements resolution.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input id is not valid for deletion.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.DeleteElements.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Creates an instance of the DeleteElements resolution.
document:
The document which owns the elements to delete.
ids:
The ids of the elements that will be deleted when this resolution is chosen.
Returns:
The instance of the DeleteElements resolution.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input ids is empty or contains an invalid element id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.DeleteElements.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Creates an instance of the DeleteElements resolution.
document:
The document which owns the elements to delete.
ids:
The ids of the elements that will be deleted when this resolution is chosen.
Returns:
The instance of the DeleteElements resolution.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input ids is empty or contains an invalid element id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.DeleteElements
Deletes element(s) related to the failure.
Since:
2011